# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Convert text to Postscript, HTML, or RTF, with syntax highlighting
brew "enscript"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Internet file retriever
brew "wget"
# Terminal-based AI coding assistant
cask "claude-code"
# Open-source code editor
cask "visual-studio-code"
vscode "adpyke.codesnap"
vscode "alefragnani.bookmarks"
vscode "anthropic.claude-code"
vscode "atlassian.atlascode"
vscode "bierner.color-info"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmewburn.vscode-intelephense-client"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dnicolson.binary-plist"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "gurumukhi.selected-lines-count"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hilleer.yaml-plus-json"
vscode "ibm.output-colorizer"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jock.svg"
vscode "juanblanco.solidity"
vscode "laravel.vscode-laravel"
vscode "lmcarreiro.vscode-smart-column-indenter"
vscode "mariano-g.plist-editor"
vscode "mechatroner.rainbow-csv"
vscode "medo64.code-point"
vscode "mehedidracula.php-namespace-resolver"
vscode "mikestead.dotenv"
vscode "mkxml.vscode-filesize"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "neilbrayfield.php-docblocker"
vscode "open-southeners.laravel-pint"
vscode "orta.vscode-jest"
vscode "quicktype.quicktype"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rvest.vs-code-prettier-eslint"
vscode "ryu1kn.partial-diff"
vscode "searking.preview-vscode"
vscode "shanoor.vscode-nginx"
vscode "shufo.vscode-blade-formatter"
vscode "steoates.autoimport"
vscode "tamasfe.even-better-toml"
vscode "technosophos.vscode-make"
vscode "timonwong.shellcheck"
vscode "wayou.vscode-todo-highlight"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yzhang.markdown-all-in-one"
vscode "zobo.php-intellisense"
